#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/petebeegle/gitlab-titler_production/runs/run-dkCkEurpmTpPmxTi

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
module.this.data.external.archive_prepare[0]: Reading...
module.this.data.aws_partition.current: Reading...
module.this.data.aws_iam_policy_document.assume_role[0]: Reading...
module.this.data.aws_region.current: Reading...
module.this.data.aws_caller_identity.current: Reading...
module.this.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.this.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.this.data.aws_partition.current: Read complete after 0s [id=aws]
module.this.data.aws_caller_identity.current: Read complete after 0s [id=392929915892]
module.this.data.external.archive_prepare[0]: Read complete after 0s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.this.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.this.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/func-gitlab-titler_production"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + tags_all          = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
    }

  # module.this.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "func-gitlab-titler_production-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + tags_all  = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
    }

  # module.this.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "func-gitlab-titler_production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + tags_all              = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.this.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "func-gitlab-titler_production"
    }

  # module.this.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "builds/b3c59e0c702082a222e6bfcb4a924f284c4a7f83dc0ef7f169e0a0f4d480ce01.zip"
      + function_name                  = "func-gitlab-titler_production"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + tags_all                       = {
          + "Environment" = "gitlab-titler_production"
          + "Name"        = "gitlab_titler"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.this.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "func-gitlab-titler_production"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)
    }

  # module.this.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./src",
                      + null,
                    ],
                ]
              + filename      = "builds/b3c59e0c702082a222e6bfcb4a924f284c4a7f83dc0ef7f169e0a0f4d480ce01.zip"
              + runtime       = "nodejs18.x"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b3c59e0c702082a222e6bfcb4a924f284c4a7f83dc0ef7f169e0a0f4d480ce01.plan.json"
      + id                   = (known after apply)
    }

  # module.this.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b3c59e0c702082a222e6bfcb4a924f284c4a7f83dc0ef7f169e0a0f4d480ce01.zip"
          + "timestamp" = "1674366411829134000"
        }
    }

  # module.this.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/b3c59e0c702082a222e6bfcb4a924f284c4a7f83dc0ef7f169e0a0f4d480ce01.zip"
          + "original_source_code" = "\"./src\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + function_name = "func-gitlab-titler_production"
  + webhook_url   = (known after apply)

```

</details>

*Pushed by: @petebeegle, Action: `pull_request`*